In [1]:
import pandas as pd
import numpy as np

In [3]:
import math
from collections import Counter
import pandas as pd
import openpyxl
from openpyxl.workbook import Workbook
from collections import defaultdict


# from tabulate import tabulate
# head = ["Ranks", "Winning_Amount", "Total_Winners", "Total_Winning Amount"]
# mydata = [[1, 2, 3, 4], [5, 6, 7, 8]]
# print(tabulate(mydata, headers=head, tablefmt="grid"))

#import self as self


def sumCalc(a):
    tsum = 0.0;
    # print(e_fee, total_winners, max_prize)
    for i in range(1, total_winners + 1):
        tsum += e_fee + (max_prize - e_fee) / i ** a
    return tsum


decVal = 1 / 10 ** 10
totSum = 0


def alphSearch(low, high):
    if high >= low:

        mid = (high + low) / 2




        totSum = sumCalc(mid)
        #print(totSum, mid)

        if math.isclose(prize_total, totSum, abs_tol=0.001):
            return mid, totSum


        elif totSum < prize_total:
            return alphSearch(low, mid - decVal, )


        else:
            return alphSearch(mid + decVal, high)

    else:
        return -1


totalplayers = int(input("No. of players: "))
e_fee = int(input("Entry Fee: "))
max_prize = int(input("Max Winning Price: "))
prize_total = e_fee * totalplayers
win_percent = 55.42857#float(input("Win % :  "))
# 55.42857

s = [25, 100, 300, 500, 1000, 2000, 5000, 10000, 50000, 194000]
v = 0
z = 6
total_winners = math.ceil(win_percent / 100 * float(totalplayers))
winnings = round(totalplayers * .5542857)
b2 = winnings - 5
# prize_topwinners = 0.06 * float(prize_total);
print("Total_prize: ", prize_total, " Total_Winners: ", total_winners)

# print(sumCalc(0.7))
alpha, totSum = alphSearch(0, 2)

print("Alpha: ", alpha, " Sum: ", round(totSum))

rank = {}
t_prize=0
for i in range(1, total_winners +1  ):
    #print(i, ": ",round(e_fee + (max_prize - e_fee) / i ** alpha))
    key = i
    value = e_fee + (max_prize - e_fee) / i ** alpha
    rank[key] = round(value)
    t_prize = t_prize + (e_fee + (max_prize - e_fee) / i ** alpha)
#for key, value in rank.items():
    #print(key, ':', value)
rev_rank = {}
for key,value in rank.items():
    rev_rank.setdefault(value, set()).add(key)
#for key, value in rev_rank.items():
    #print(key, ':', value)
#print(rev_rank)
#print(rank)
print('total prize=',round(t_prize))
def maprange(a, b, s):
    (a1, a2), (b1, b2) = a, b
    t = round(b1 + ((s - a1) * (b2 - b1) / (a2 - a1)))
    return t
a = list(rev_rank.values())
b = list(rev_rank.keys())
for i in range(0, winnings):
        if v < 10:
          t = maprange((0, 193995), (0, b2), s[v])
          if t >= z:
              print(rev_rank.values(), " maps to ", rev_rank.keys(), "winners=" , t - z + 1 )
          v += 1
          z = t + 1
c = totalplayers/100*win_percent
#print('Last rank is:',round(c))

def bucket_sort(alist):
    largest = max(alist)
    length = len(alist)
    size = largest / length

    buckets = [[] for _ in range(length)]
    for i in range(length):
        j = int(alist[i] / size)
        if j != length:
            buckets[j].append(alist[i])
        else:
            buckets[length - 1].append(alist[i])

    for i in range(length):
        insertion_sort(buckets[i])

    result = []
    for i in range(length):
        result = result + buckets[i]

    return result


def insertion_sort(alist):
    for i in range(1, len(alist)):
        temp = alist[i]
        j = i - 1
        while (j >= 0 and temp < alist[j]):
            alist[j + 1] = alist[j]
            j = j - 1
        alist[j + 1] = temp

list=[]
for i in range(1,total_winners):
    #print(i, ": ", round(e_fee + (max_prize - e_fee) / i ** alpha))
    list.append( round(e_fee + (max_prize - e_fee) / i ** alpha))
alist = list
alist = [int(x) for x in alist]
sorted_list = bucket_sort(alist)
#print('Sorted list: ', end='')
#print(sorted_list)
sorted_list.reverse()
#print(sorted_list)
count = Counter(sorted_list)
#print(sorted_list)
print(count)
#headerlist = ['Rank', 'Price']
df = pd.DataFrame(data=rank,index=[0])
#df.columns = ["Rank", "Price"]
df = (df.T)
print(df)

#df.to_excel('dict500.xlsx')
#wrkbk = openpyxl.load_workbook("dict.xlsx")
#sh = wrkbk.active
#for i in range(1, sh.max_row+1):
    #print("\n")
    #print("Row",i,"data:")

    #for j in range(1, sh.max_column+1):
        #cell_obj = sh.cell(row=i,column=j)
        #print(cell_obj.value,end='')
#l = int(input("Enter the limit:"))
#for i in range(l):
    #o = int(input("Enter the prize:"))
    #if o in count:
        #print(count[o])
    #else:
        #print("No rank found")
#rint('1 Rupees will get',count_1,'peoples')
#mean = statistics.mean(e_fee + (max_prize - e_fee)/ i ** alpha)
#print(mean)


#mean = statistics.mean(sum)
#print(mean)
#def maprange(a, b, s):
#    (a1, a2), (b1, b2) = a, b
 #   return b1 + ((s - a1) * (b2 - b1) / (a2 - a1))

# for s in range(11):
#    print("%2g maps to %g" % (s, maprange((0, 10), (-1, 0), s))

#55.42857


#list urllib keyword

No. of players: 300
Entry Fee: 1
Max Winning Price: 9
Total_prize:  300  Total_Winners:  167
Alpha:  0.6146392821880264  Sum:  300
total prize= 300
dict_values([{1}, {2}, {3}, {4, 5, 6}, {7, 8, 9, 10, 11, 12, 13, 14, 15}, {16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34, 35, 36, 37, 38, 39, 40, 41, 42, 43, 44, 45, 46, 47, 48, 49, 50, 51, 52, 53, 54, 55, 56, 57, 58, 59, 60, 61, 62, 63, 64, 65, 66, 67, 68, 69, 70, 71, 72, 73, 74, 75, 76, 77, 78, 79, 80, 81, 82, 83, 84, 85, 86, 87, 88, 89, 90, 91}, {128, 129, 130, 131, 132, 133, 134, 135, 136, 137, 138, 139, 140, 141, 142, 143, 144, 145, 146, 147, 148, 149, 150, 151, 152, 153, 154, 155, 156, 157, 158, 159, 160, 161, 162, 163, 164, 165, 166, 167, 92, 93, 94, 95, 96, 97, 98, 99, 100, 101, 102, 103, 104, 105, 106, 107, 108, 109, 110, 111, 112, 113, 114, 115, 116, 117, 118, 119, 120, 121, 122, 123, 124, 125, 126, 127}])  maps to  dict_keys([9, 6, 5, 4, 3, 2, 1]) winners= 1
dict_values([{1}, {2}, {3}, {4, 5, 6}, {7, 8, 9, 10, 11, 12, 13, 14, 15}, {16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34, 35, 36, 37, 38, 39, 40, 41, 42, 43, 44, 45, 46, 47, 48, 49, 50, 51, 52, 53, 54, 55, 56, 57, 58, 59, 60, 61, 62, 63, 64, 65, 66, 67, 68, 69, 70, 71, 72, 73, 74, 75, 76, 77, 78, 79, 80, 81, 82, 83, 84, 85, 86, 87, 88, 89, 90, 91}, {128, 129, 130, 131, 132, 133, 134, 135, 136, 137, 138, 139, 140, 141, 142, 143, 144, 145, 146, 147, 148, 149, 150, 151, 152, 153, 154, 155, 156, 157, 158, 159, 160, 161, 162, 163, 164, 165, 166, 167, 92, 93, 94, 95, 96, 97, 98, 99, 100, 101, 102, 103, 104, 105, 106, 107, 108, 109, 110, 111, 112, 113, 114, 115, 116, 117, 118, 119, 120, 121, 122, 123, 124, 125, 126, 127}])  maps to  dict_keys([9, 6, 5, 4, 3, 2, 1]) winners= 1
dict_values([{1}, {2}, {3}, {4, 5, 6}, {7, 8, 9, 10, 11, 12, 13, 14, 15}, {16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34, 35, 36, 37, 38, 39, 40, 41, 42, 43, 44, 45, 46, 47, 48, 49, 50, 51, 52, 53, 54, 55, 56, 57, 58, 59, 60, 61, 62, 63, 64, 65, 66, 67, 68, 69, 70, 71, 72, 73, 74, 75, 76, 77, 78, 79, 80, 81, 82, 83, 84, 85, 86, 87, 88, 89, 90, 91}, {128, 129, 130, 131, 132, 133, 134, 135, 136, 137, 138, 139, 140, 141, 142, 143, 144, 145, 146, 147, 148, 149, 150, 151, 152, 153, 154, 155, 156, 157, 158, 159, 160, 161, 162, 163, 164, 165, 166, 167, 92, 93, 94, 95, 96, 97, 98, 99, 100, 101, 102, 103, 104, 105, 106, 107, 108, 109, 110, 111, 112, 113, 114, 115, 116, 117, 118, 119, 120, 121, 122, 123, 124, 125, 126, 127}])  maps to  dict_keys([9, 6, 5, 4, 3, 2, 1]) winners= 2
dict_values([{1}, {2}, {3}, {4, 5, 6}, {7, 8, 9, 10, 11, 12, 13, 14, 15}, {16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34, 35, 36, 37, 38, 39, 40, 41, 42, 43, 44, 45, 46, 47, 48, 49, 50, 51, 52, 53, 54, 55, 56, 57, 58, 59, 60, 61, 62, 63, 64, 65, 66, 67, 68, 69, 70, 71, 72, 73, 74, 75, 76, 77, 78, 79, 80, 81, 82, 83, 84, 85, 86, 87, 88, 89, 90, 91}, {128, 129, 130, 131, 132, 133, 134, 135, 136, 137, 138, 139, 140, 141, 142, 143, 144, 145, 146, 147, 148, 149, 150, 151, 152, 153, 154, 155, 156, 157, 158, 159, 160, 161, 162, 163, 164, 165, 166, 167, 92, 93, 94, 95, 96, 97, 98, 99, 100, 101, 102, 103, 104, 105, 106, 107, 108, 109, 110, 111, 112, 113, 114, 115, 116, 117, 118, 119, 120, 121, 122, 123, 124, 125, 126, 127}])  maps to  dict_keys([9, 6, 5, 4, 3, 2, 1]) winners= 4
dict_values([{1}, {2}, {3}, {4, 5, 6}, {7, 8, 9, 10, 11, 12, 13, 14, 15}, {16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34, 35, 36, 37, 38, 39, 40, 41, 42, 43, 44, 45, 46, 47, 48, 49, 50, 51, 52, 53, 54, 55, 56, 57, 58, 59, 60, 61, 62, 63, 64, 65, 66, 67, 68, 69, 70, 71, 72, 73, 74, 75, 76, 77, 78, 79, 80, 81, 82, 83, 84, 85, 86, 87, 88, 89, 90, 91}, {128, 129, 130, 131, 132, 133, 134, 135, 136, 137, 138, 139, 140, 141, 142, 143, 144, 145, 146, 147, 148, 149, 150, 151, 152, 153, 154, 155, 156, 157, 158, 159, 160, 161, 162, 163, 164, 165, 166, 167, 92, 93, 94, 95, 96, 97, 98, 99, 100, 101, 102, 103, 104, 105, 106, 107, 108, 109, 110, 111, 112, 113, 114, 115, 116, 117, 118, 119, 120, 121, 122, 123, 124, 125, 126, 127}])  maps to  dict_keys([9, 6, 5, 4, 3, 2, 1]) winners= 33
dict_values([{1}, {2}, {3}, {4, 5, 6}, {7, 8, 9, 10, 11, 12, 13, 14, 15}, {16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34, 35, 36, 37, 38, 39, 40, 41, 42, 43, 44, 45, 46, 47, 48, 49, 50, 51, 52, 53, 54, 55, 56, 57, 58, 59, 60, 61, 62, 63, 64, 65, 66, 67, 68, 69, 70, 71, 72, 73, 74, 75, 76, 77, 78, 79, 80, 81, 82, 83, 84, 85, 86, 87, 88, 89, 90, 91}, {128, 129, 130, 131, 132, 133, 134, 135, 136, 137, 138, 139, 140, 141, 142, 143, 144, 145, 146, 147, 148, 149, 150, 151, 152, 153, 154, 155, 156, 157, 158, 159, 160, 161, 162, 163, 164, 165, 166, 167, 92, 93, 94, 95, 96, 97, 98, 99, 100, 101, 102, 103, 104, 105, 106, 107, 108, 109, 110, 111, 112, 113, 114, 115, 116, 117, 118, 119, 120, 121, 122, 123, 124, 125, 126, 127}])  maps to  dict_keys([9, 6, 5, 4, 3, 2, 1]) winners= 120
Counter({2: 76, 1: 75, 3: 9, 4: 3, 9: 1, 6: 1, 5: 1})
     0
1    9
2    6
3    5
4    4
5    4
..  ..
163  1
164  1
165  1
166  1
167  1

[167 rows x 1 columns]

In [5]:
df1 = pd.read_excel("dict.xlsx")

In [6]:
df1

     Rank  Prize
0       1      9
1       2      6
2       3      5
3       4      4
4       5      4
..    ...    ...
162   163      1
163   164      1
164   165      1
165   166      1
166   167      1

[167 rows x 2 columns]

In [11]:
df1.head()

   Rank  Prize
0     1      9
1     2      6
2     3      5
3     4      4
4     5      4

In [12]:
df1["Prize"]

0      9
1      6
2      5
3      4
4      4
      ..
162    1
163    1
164    1
165    1
166    1
Name: Prize, Length: 167, dtype: int64

In [19]:
df1.groupby('Prize')

In [20]:
df1

     Rank  Prize
0       1      9
1       2      6
2       3      5
3       4      4
4       5      4
..    ...    ...
162   163      1
163   164      1
164   165      1
165   166      1
166   167      1

[167 rows x 2 columns]

In [24]:
df2 = pd.read_excel("dict350000.xlsx")

In [25]:

df2

        Unnamed: 0      0
0                1  10000
1                2   5118
2                3   3459
3                4   2619
4                5   2111
...            ...    ...
193995      193996      1
193996      193997      1
193997      193998      1
193998      193999      1
193999      194000      1

[194000 rows x 2 columns]

In [26]:
df2.columns = ["Rank", "Prize"]

##

In [27]:
df2

          Rank  Prize
0            1  10000
1            2   5118
2            3   3459
3            4   2619
4            5   2111
...        ...    ...
193995  193996      1
193996  193997      1
193997  193998      1
193998  193999      1
193999  194000      1

[194000 rows x 2 columns]

In [35]:
bins = [6,25, 100, 300, 500, 1000, 2000, 5000, 10000, 50000, 194000]
df2['binned'] = pd.cut(df2['Rank'],bins)
df2.head(30)

    Rank  Prize         binned
0      1  10000            NaN
1      2   5118            NaN
2      3   3459            NaN
3      4   2619            NaN
4      5   2111            NaN
5      6   1770            NaN
6      7   1525    (6.0, 25.0]
7      8   1341    (6.0, 25.0]
8      9   1197    (6.0, 25.0]
9     10   1081    (6.0, 25.0]
10    11    986    (6.0, 25.0]
11    12    906    (6.0, 25.0]
12    13    839    (6.0, 25.0]
13    14    781    (6.0, 25.0]
14    15    731    (6.0, 25.0]
15    16    687    (6.0, 25.0]
16    17    648    (6.0, 25.0]
17    18    613    (6.0, 25.0]
18    19    582    (6.0, 25.0]
19    20    554    (6.0, 25.0]
20    21    528    (6.0, 25.0]
21    22    505    (6.0, 25.0]
22    23    484    (6.0, 25.0]
23    24    464    (6.0, 25.0]
24    25    446    (6.0, 25.0]
25    26    430  (25.0, 100.0]
26    27    414  (25.0, 100.0]
27    28    400  (25.0, 100.0]
28    29    387  (25.0, 100.0]
29    30    374  (25.0, 100.0]

In [36]:
bins = [6,25, 100, 300, 500, 1000, 2000, 5000, 10000, 50000, 194000]
df1['binned'] = pd.cut(df1['Rank'],bins)
df1.head(30)

    Rank  Prize         binned
0      1      9            NaN
1      2      6            NaN
2      3      5            NaN
3      4      4            NaN
4      5      4            NaN
5      6      4            NaN
6      7      3    (6.0, 25.0]
7      8      3    (6.0, 25.0]
8      9      3    (6.0, 25.0]
9     10      3    (6.0, 25.0]
10    11      3    (6.0, 25.0]
11    12      3    (6.0, 25.0]
12    13      3    (6.0, 25.0]
13    14      3    (6.0, 25.0]
14    15      3    (6.0, 25.0]
15    16      2    (6.0, 25.0]
16    17      2    (6.0, 25.0]
17    18      2    (6.0, 25.0]
18    19      2    (6.0, 25.0]
19    20      2    (6.0, 25.0]
20    21      2    (6.0, 25.0]
21    22      2    (6.0, 25.0]
22    23      2    (6.0, 25.0]
23    24      2    (6.0, 25.0]
24    25      2    (6.0, 25.0]
25    26      2  (25.0, 100.0]
26    27      2  (25.0, 100.0]
27    28      2  (25.0, 100.0]
28    29      2  (25.0, 100.0]
29    30      2  (25.0, 100.0]

In [37]:
df1['Prize'].describe()

count    167.000000
mean       1.718563
std        0.974903
min        1.000000
25%        1.000000
50%        2.000000
75%        2.000000
max        9.000000
Name: Prize, dtype: float64

In [39]:
df2['Prize'].describe()

count    194000.000000
mean          1.679577
std          29.699144
min           1.000000
25%           1.000000
50%           1.000000
75%           1.000000
max       10000.000000
Name: Prize, dtype: float64

In [45]:
pd.qcut(df1['Prize'],q=166)

ValueError: Bin edges must be unique: array([1., 1., 1., 1., 1., 1., 1., 1., 1., 1., 1., 1., 1., 1., 1., 1., 1.,
       1., 1., 1., 1., 1., 1., 1., 1., 1., 1., 1., 1., 1., 1., 1., 1., 1.,
       1., 1., 1., 1., 1., 1., 1., 1., 1., 1., 1., 1., 1., 1., 1., 1., 1.,
       1., 1., 1., 1., 1., 1., 1., 1., 1., 1., 1., 1., 1., 1., 1., 1., 1.,
       1., 1., 1., 1., 1., 1., 1., 1., 2., 2., 2., 2., 2., 2., 2., 2., 2.,
       2., 2., 2., 2., 2., 2., 2., 2., 2., 2., 2., 2., 2., 2., 2., 2., 2.,
       2., 2., 2., 2., 2., 2., 2., 2., 2., 2., 2., 2., 2., 2., 2., 2., 2.,
       2., 2., 2., 2., 2., 2., 2., 2., 2., 2., 2., 2., 2., 2., 2., 2., 2.,
       2., 2., 2., 2., 2., 2., 2., 2., 2., 2., 2., 2., 2., 2., 2., 2., 3.,
       3., 3., 3., 3., 3., 3., 3., 3., 4., 4., 4., 5., 6., 9.]).
You can drop duplicate edges by setting the 'duplicates' kwarg

In [46]:
df1

     Rank  Prize          binned
0       1      9             NaN
1       2      6             NaN
2       3      5             NaN
3       4      4             NaN
4       5      4             NaN
..    ...    ...             ...
162   163      1  (100.0, 300.0]
163   164      1  (100.0, 300.0]
164   165      1  (100.0, 300.0]
165   166      1  (100.0, 300.0]
166   167      1  (100.0, 300.0]

[167 rows x 3 columns]

In [60]:
df2

        Unnamed: 0      0
0                1  10000
1                2   5118
2                3   3459
3                4   2619
4                5   2111
...            ...    ...
193995      193996      1
193996      193997      1
193997      193998      1
193998      193999      1
193999      194000      1

[194000 rows x 2 columns]

In [62]:
df2.columns = ['Rank', 'Prize']
df2

          Rank  Prize
0            1  10000
1            2   5118
2            3   3459
3            4   2619
4            5   2111
...        ...    ...
193995  193996      1
193996  193997      1
193997  193998      1
193998  193999      1
193999  194000      1

[194000 rows x 2 columns]

In [68]:
df2['binned'] = pd.qcut(df2['Prize'],1)

TypeError: ufunc 'isnan' not supported for the input types, and the inputs could not be safely coerced to any supported types according to the casting rule ''safe''

In [69]:
 df1

     Rank  Prize          binned
0       1      9             NaN
1       2      6             NaN
2       3      5             NaN
3       4      4             NaN
4       5      4             NaN
..    ...    ...             ...
162   163      1  (100.0, 300.0]
163   164      1  (100.0, 300.0]
164   165      1  (100.0, 300.0]
165   166      1  (100.0, 300.0]
166   167      1  (100.0, 300.0]

[167 rows x 3 columns]

In [74]:
df1['binned'] = pd.cut(
    df1['Rank'],
    [6,25, 100, 300, 500, 1000, 2000, 5000, 10000, 50000, 194000],
    labels = ['6-25','25-100','100-300','300-500','500-1000','1000-2000','2000-5000','5000-10000','10000-50000','50000-194000'],
    ordered= True
)
df1

     Rank  Prize   binned
0       1      9      NaN
1       2      6      NaN
2       3      5      NaN
3       4      4      NaN
4       5      4      NaN
..    ...    ...      ...
162   163      1  100-300
163   164      1  100-300
164   165      1  100-300
165   166      1  100-300
166   167      1  100-300

[167 rows x 3 columns]

In [76]:
df1.Prize.duplicated()

0      False
1      False
2      False
3      False
4       True
       ...
162     True
163     True
164     True
165     True
166     True
Name: Prize, Length: 167, dtype: bool

In [86]:
df1.Prize.drop_duplicates(keep='first')

0     9
1     6
2     5
3     4
6     3
15    2
91    1
Name: Prize, dtype: int64

In [87]:
df1.Prize.drop_duplicates(keep='last')

0      9
1      6
2      5
5      4
14     3
90     2
166    1
Name: Prize, dtype: int64

In [88]:
df1.index += 1
df1.index

RangeIndex(start=1, stop=168, step=1)

In [90]:
df1.Prize.drop_duplicates(keep='last')

1      9
2      6
3      5
6      4
15     3
91     2
167    1
Name: Prize, dtype: int64

In [91]:
df2

          Rank             Prize
0            1  (0.999, 10000.0]
1            2  (0.999, 10000.0]
2            3  (0.999, 10000.0]
3            4  (0.999, 10000.0]
4            5  (0.999, 10000.0]
...        ...               ...
193995  193996  (0.999, 10000.0]
193996  193997  (0.999, 10000.0]
193997  193998  (0.999, 10000.0]
193998  193999  (0.999, 10000.0]
193999  194000  (0.999, 10000.0]

[194000 rows x 2 columns]

In [92]:
df2 = pd.read_excel("dict350000.xlsx")

In [93]:
df2

        Unnamed: 0      0
0                1  10000
1                2   5118
2                3   3459
3                4   2619
4                5   2111
...            ...    ...
193995      193996      1
193996      193997      1
193997      193998      1
193998      193999      1
193999      194000      1

[194000 rows x 2 columns]

In [94]:
df2.columns=['Rank','Prize']

In [95]:
df2

          Rank  Prize
0            1  10000
1            2   5118
2            3   3459
3            4   2619
4            5   2111
...        ...    ...
193995  193996      1
193996  193997      1
193997  193998      1
193998  193999      1
193999  194000      1

[194000 rows x 2 columns]

In [96]:
df2.index +=1
df2.index

RangeIndex(start=1, stop=194001, step=1)

In [100]:
df1.Prize.drop_duplicates(keep='last')

1      9
2      6
3      5
6      4
15     3
91     2
167    1
Name: Prize, dtype: int64

In [124]:
df2.Prize.drop_duplicates(keep='last').shape

(216,)

In [102]:
df3 = pd.read_excel("dict500.xlsx")

In [103]:
df3.columns=['Rank','Prize']

In [104]:
df3

     Rank  Prize
0       1     14
1       2      9
2       3      7
3       4      6
4       5      5
..    ...    ...
273   274      1
274   275      1
275   276      1
276   277      1
277   278      1

[278 rows x 2 columns]

In [105]:
df3.index +=1
df3.index

RangeIndex(start=1, stop=279, step=1)

In [123]:
df3.Prize.drop_duplicates(keep="last")

1      14
2       9
3       7
4       6
7       5
11      4
25      3
131     2
278     1
Name: Prize, dtype: int64

In [119]:
 df2.head(20000)

        Rank  Prize
1          1  10000
2          2   5118
3          3   3459
4          4   2619
5          5   2111
...      ...    ...
19996  19996      2
19997  19997      2
19998  19998      2
19999  19999      2
20000  20000      2

[20000 rows x 2 columns]

In [121]:
df2.shape

(194000, 2)